frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('wer', 'grid11@i.ua', '$2y$13$cMJmmzzpxNUAtiwlODXt/.xrpV7jic7PpNvny947mzvLymPWIO/xK', 'qec0rSAU5oSfUQ-aujInLFQhbl31n8iE', 'G2YPy6khVa4eXob9GZMMpgaxzwJ1FKgP_1614950197', 9, 1614950197, 1614950197)